#ifndef _OV_Frame_H
#define _OV_Frame_H


#include "sccb.h"
//////////////////////////////////////////////////////////////////////////////////	 

/************************************************************************************************/
//OV5640 驱动代码

//STM32H7工程模板-HAL库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	


/************************************************************************************************/
					  

void OV_Camera_Demo(uint8_t Key_Value);


void jpeg_data_process(void);

void JPEG_mode(void);
void rgblcd_dcmi_rx_callback(void);
void RGB565_mode(void);
	



#endif
























/************************************************************************************************/
//OV5640 驱动代码

//STM32H7工程模板-HAL库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	


/************************************************************************************************/













